#pragma once

// Pubg Mobile Beta (3.0) SDK by Telegram @Sanjay_Src

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_HallThemeItem_type.BP_STRUCT_HallThemeItem_type
// 0x0190
struct FBP_STRUCT_HallThemeItem_type
{
	int                                                itemId_0_05AB9D40399D42531091E2D207055864;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     skinLevelName_1_559291C07BED8CD91D86A5EC06628D85;         // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     skinId_2_21CE1EC00F0DEDC7628895A907AE1B64;                // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     vehicleScale_3_18B1B84057E5C0996932DCA5056D8235;          // 0x001C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     vehicleRotation_4_531D72400EAEDF437EA1408A07C9FA8E;       // 0x0028(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     vehiclePosition_5_4614D38008FDCBAA5E3100C90801FA6E;       // 0x0034(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     footScale_24_4BAD2E4043BD55FB478A4D300900FB95;            // 0x0040(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     footPosition_25_1A7F498024C4CB9079DDF298005B3F5E;         // 0x004C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel3Rotation_26_2FB2AC40356A0C6333D8BB1707EAC13E;       // 0x0058(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel2Rotation_27_65D2AC006A4A710226C2155D07EAD03E;       // 0x0064(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     footRotation_28_2787E8403E2686FF58BC4E170073407E;         // 0x0070(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     boatScale_29_31B9A9C03C7F6B3564CF8B540700FF85;            // 0x007C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     motoBoatRotation_30_04D46B80758344F43D3EF9A70C8A70AE;     // 0x0088(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     motoBoatPosition_31_77CBCCC07F3D3A251A0D88AC0CC2704E;     // 0x0094(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     snowMotoPosition_32_387BF50062B2919E27D1FD3B0531B75E;     // 0x00A0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     motoBoatScale_33_138291803415844629D6B7050C0F3605;        // 0x00AC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     snowMotoRotation_34_458493C058F89C6D2ABB9C2F0519B87E;     // 0x00B8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     boatRotation_35_71A323C047E1D14566F9E3840032E07E;         // 0x00C4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     snowMotoScale_36_5AC319C01C0294ED38E9CF4C0180AD35;        // 0x00D0(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel2Position_37_58CA0D4014EB11633925055507E2D09E;       // 0x00DC(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel3Position_38_22AA0D80600AACC45AD80A9507E2C19E;       // 0x00E8(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     boatPosition_39_649A85002E8015D67CB18E9E001ADF5E;         // 0x00F4(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel3Scale_40_4D3DF24024C2CE271C4B56EF06F48405;          // 0x0100(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     wheel2Scale_41_598992005DA8E7D86273D45906048405;          // 0x010C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WingmanPosition_42_414A2FC06C5C4E2B488CA8390DDA92DE;      // 0x0118(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WingmanRotation_43_4E52CE80720D61C4362DADC40DF292FE;      // 0x0124(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     WingmanScale_44_6E85748036070D9208224AC603E82385;         // 0x0130(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     Path_45_5E37C9804E67E12859DF6CDD09956758;                 // 0x013C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TankPosition_46_2FBD9F006D30F70E2613FE950349665E;         // 0x0148(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TankRotation_47_3CC63DC00692B27D2E8180200301677E;         // 0x0154(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     TankScale_48_1FA3C3C079A7AFFD7F9DACF20C90CEB5;            // 0x0160(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     ByciclePosition_49_4B11CA4049F810B536A4B1570101CD2E;      // 0x016C(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BycicleRotation_50_581A69004FA9244E526FC4D000C9CDCE;      // 0x0178(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     BycicleScale_51_2D7CCF0038DB2CCC1E1BA6860639F235;         // 0x0184(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

