#pragma once

// Pubg Mobile Beta (3.0) SDK by Telegram @Sanjay_Src

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_TransSupportConfig_VNG_type.BP_STRUCT_TransSupportConfig_VNG_type
// 0x002C
struct FBP_STRUCT_TransSupportConfig_VNG_type
{
	struct FString                                     languageCode_0_304AFE8018A810121E76A0640E962C35;          // 0x0000(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                languageID_1_5EE4C3007F0B28564BBEEDDA099E9654;            // 0x000C(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     abbreviation_2_165B2C4025E15717066345A104E9F1BE;          // 0x0010(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	bool                                               isSupported_3_764957401C185393258AE03A06008C04;           // 0x001C(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x001D(0x0003) MISSED OFFSET
	struct FString                                     displayName_4_47ECCC80441140EA6B09913A0001D215;           // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

