#pragma once

// Pubg Mobile Beta (3.0) SDK by Telegram @Sanjay_Src

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct BP_STRUCT_RareItemCfg_type.BP_STRUCT_RareItemCfg_type
// 0x002C
struct FBP_STRUCT_RareItemCfg_type
{
	int                                                ItemId_0_55BFBEC07701C41544D45E42080B2824;                // 0x0000(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     Path_1_7CF17300760414C62D59F2D009D66908;                  // 0x0004(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	int                                                RareType_2_23881AC04B9D705F2709505A092376E5;              // 0x0010(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FString                                     PathIcon_4_38B2D5406371AFD77F54A0AF0905303E;              // 0x0014(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
	struct FString                                     CornerPath_5_01B30D403311FBA129EBCE9E0D10CF98;            // 0x0020(0x000C) (Edit, BlueprintVisible, ZeroConstructor)
};

}

